Repository: rafinha-as-br/TravelMaker
Catalog: travelmakerapp/lib/l10n/app_*.arb
Languages: es

# welcome
source: Hello! Welcome!
es: ¡Hola! ¡Bienvenido!

# beforeStart
source: Before we start
es: Antes de empezar

# informNameAge
source: Tell us your name and age!
es: ¡Dinos tu nombre y edad!

# continuee
source: Continue
es: Continuar

source: Good morning!
es: ¡Buenos días!

# goodAfternon
source: Good afternoon!
es: ¡Buenas tardes!

source: Good Night
es: ¡Buenas noches!

source: Let''s go travel?
es: ¿Vamos a viajar?

# createTravel
source: Make a travel
es: Crear un viaje

# travelList
source: My trips
es: Mis viajes

# userConfig
source: User & configurations
es: Usuario y configuraciones

source: Change language
es: Cambiar idioma

source: Your name
es: Tu nombre

source: Your age
es: Tu edad

# addProfilePictureInform1
source: You can add a profile picture anytime in the user section!
es: ¡Puedes añadir una foto de perfil en cualquier momento en la sección de usuario!

source: Light theme
es: Tema claro

source: Dark theme
es: Tema oscuro

source: Delete user
es: Eliminar usuario

source: years
es: años

source: Name
es: Nombre

source: Age
es: Edad

# creatingTravel
source: Creating a travel!
es: ¡Creando un viaje!

# giveTravelTitle
source: Travel title
es: Título del viaje

# travelTitleText
source: Every travel needs a memorable name, what''s going to be this one?
es: Cada viaje necesita un nombre memorable, ¿cuál será este?

source: Title
es: Título

# giveTravelDescription
source: Give-us a description!
es: ¡Danos una descripción!

# travelDescriptionText
source: What''s the most important thing you want to write down to not forget it?
es: ¿Qué es lo más importante que quieres anotar para no olvidarlo?

source: Description
es: Descripción

# finalDestinationTitle
source: Final destination
es: Destino final

# finalDestination
source: Every travel has a final destination, where do you want to go?
es: Cada viaje tiene un destino final, ¿a dónde quieres ir?

source: City
es: Ciudad

source: Add participants
es: Añadir participantes

# addPerson
source: Add this person
es: Añadir esta persona

source: Save alterations
es: Guardar cambios

# addParticipantsText
source: Add the companions of this travel
es: Añade los acompañantes de este viaje

source: Participants
es: Participantes

# addParticipantsButtonText
source: Add participant
es: Añadir participante

source: Start & end date
es: Fecha de inicio y fin

# startEndDateText
source: When we''re starting this travel and until when it extends?
es: ¿Cuándo empieza este viaje y hasta cuándo se extiende?

source: Start date
es: Fecha de inicio

source: End date
es: Fecha de fin

# desiredTransportTitle
source: Desired means of transport
es: Medio de transporte deseado

# desiredTransportText
source: Pick the way you''d like to travel on this trip!
es: ¡Elige cómo te gustaría viajar en este viaje!

source: Vehicles
es: Vehículos

# chosenMean
source: You picked:
es: Has elegido:

# travelStopTitle
source: Stops of this travel
es: Paradas del viaje

# travelStopText
source: Before going into the final destination, what about making a tour in a near city?
es: Antes de llegar al destino final, ¿qué tal hacer un recorrido en una ciudad cercana?

# travelStopsText2
source: Travel Stops
es: Paradas del viaje

# addTravelStop
source: Add stop
es: Añadir parada

# createTravelButton
source: Create travel!
es: ¡Crear viaje!

source: Experiences
es: Experiencias

# experiencesText
source: What experiences do you want to live in this travel?
es: ¿Qué experiencias quieres vivir en este viaje?

# experiencesEmpty
source: No experience added
es: Ninguna experiencia añadida

# addExperience
source: Add expecience
es: Añadir experiencia

# addPhoto
source: Touch to add picture
es: Toca para añadir foto

# replacePhoto
source: Touch to replace the picture
es: Toca para reemplazar la foto

source: Participant
es: Participante

# haveProblem
source: Ops! We have a problem!
es: ¡Ups! ¡Tenemos un problema!

source: Understood!
es: ¡Entendido!

source: Person name
es: Nombre de la persona

source: Person age
es: Edad de la persona

# errorTitleEmpty
source: The travel needs to have a title!
es: ¡El viaje debe tener un título!

# errorTitleShort
source: The travel title needs to have at least 2 characters
es: El título del viaje debe tener al menos 2 caracteres

# errorDescriptionEmpty
source: The travel needs to have a descprition
es: El viaje debe tener una descripción

# errorDescriptionShort
source: The travel description needs to have at least 2 characters
es: La descripción del viaje debe tener al menos 2 caracteres

# errorCityEmpty
source: You need to select a city!
es: ¡Debes seleccionar una ciudad!

# errorVehicleNotSelected
source: You need to select a vehicle!
es: ¡Debes seleccionar un vehículo!

# errorDatesNotSelected
source: You need to select a departure and arrival date!
es: ¡Debes seleccionar una fecha de salida y llegada!

# errorDepartureDateBeforeToday
source: The departure date can''t be before today''s date!
es: ¡La fecha de salida no puede ser anterior a la fecha de hoy!

# errorArrivalDateBeforeDeparture
source: The arrival date cant''t be before the departure date!
es: ¡La fecha de llegada no puede ser anterior a la fecha de salida!

# errorPersonNameEmpty
source: You need to inform your name!
es: ¡Debes informar tu nombre!

# errorPersonNameShort
source: The name needs to contains at least three letters
es: El nombre debe contener al menos tres letras

# errorPersonAgeEmpty
source: You need to inform your age!
es: ¡Debes informar tu edad!

# errorPersonAgeInvalid
source: Type a valid number for age
es: Introduce un número válido para la edad

# errorExperiencesListEmpty
source: You need to select at least one experience!
es: ¡Debes seleccionar al menos una experiencia!

# errorInvalidCoordinates
source: Error on finding the coordinates of the selected city, check your internet status
es: Error al encontrar las coordenadas de la ciudad seleccionada, revisa tu conexión a internet

source: Car
es: Coche

source: Boat
es: Barco

source: Train
es: Tren

source: Bus
es: Autobús

source: Airplane
es: Avión

source: Not selected
es: No seleccionado
